app/views/attendees/_attendee.html.erb

SELECT "stamps".* FROM "stamps" WHERE "stamps"."attendee_id" = ?  [["attendee_id", 1]]
---

			 <% @time = Stamp.where(:attendee_id => attendee.id).last %>