app/views/attendees/index.html.erb

SELECT  "stamps".* FROM "stamps" WHERE "stamps"."attendee_id" = ? ORDER BY "stamps"."id" DESC LIMIT ?  [["attendee_id", 1], ["LIMIT", 1]]
---
           </td>
        <% @time = Stamp.where(:attendee_id => attendee.id).last %>