app/views/attendees/show.html.erb

	<div id="sign_in">
		<% @attendee.stamps.each do |t| %>
---
SELECT "stamps".* FROM "stamps" WHERE "stamps"."attendee_id" = ?  [["attendee_id", 6]]