app/controllers/attendees_controller.rb

	def index
		@attendee = Attendee.new
		@attendees = current_user.attendees.page(params[:page])
---
SELECT  "attendees".* FROM "attendees" WHERE "attendees"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 11]]

	def show
		@stamps = @attendee.stamps.order("created_at DESC").page(params[:page]).per(13)
		client = OAuth2::Client.new( ENV["FT_UID"],  ENV["FT_SECRET"], site:"https://api.intra.42.fr")
		token = client.client_credentials.get_token
		@user_quest = token.get("/v2/users/" + @attendee.login).parsed
---
SELECT "stamps".* FROM "stamps" WHERE "stamps"."attendee_id" = ?  [["attendee_id", 2]]

	def sign_in
		@attendee = current_user.attendees.find(params[:attendee_id]).stamps.build
		@attendee.sign_in = Time.now
		respond_to do |format|
			if @attendee.save
---
SELECT  "attendees".* FROM "attendees" WHERE "attendees"."user_id" = ? AND "attendees"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
INSERT INTO "stamps" ("sign_in", "attendee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sign_in", "2018-06-25 13:14:58.519164"], ["attendee_id", 2], ["created_at", "2018-06-25 13:14:58.519876"], ["updated_at", "2018-06-25 13:14:58.519876"]]

	def sign_out
		@attendee = Stamp.find(params[:id])
		@attendee.sign_out = Time.now
		respond_to do |format|
			if @attendee.save
---
SELECT  "stamps".* FROM "stamps" WHERE "stamps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "stamps" SET "sign_out" = ?, "updated_at" = ? WHERE "stamps"."id" = ?  [["sign_out", "2018-06-25 13:15:00.735263"], ["updated_at", "2018-06-25 13:15:00.736730"], ["id", 1]]

	def create
		client = OAuth2::Client.new( ENV["FT_UID"],  ENV["FT_SECRET"], site:"https://api.intra.42.fr")
		token = client.client_credentials.get_token
		@user_quest = token.get("/v2/users/" + params[:attendee][:login]).parsed
		# if @user_quest.nil?
		# 	errors.add( message: "cannot be nil")
		# end

		@attendee = current_user.attendees.build(attendee_params)
		@attendee.name =  @user_quest["displayname"]
		respond_to do |format|
			if @attendee.save
---
INSERT INTO "attendees" ("name", "login", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Rü"], ["login", ""], ["user_id", 1], ["created_at", "2018-06-25 13:14:41.670189"], ["updated_at", "2018-06-25 13:14:41.670189"]]

	def destroy
		@attendee.destroy
---
DELETE FROM "attendees" WHERE "attendees"."id" = ?  [["id", 1]]

	def set_attendee
		@attendee = current_user.attendees.find(params[:id])
---
SELECT  "attendees".* FROM "attendees" WHERE "attendees"."user_id" = ? AND "attendees"."id" = ? LIMIT ?  [["user_id", 1], ["id", 4], ["LIMIT", 1]]