app/controllers/attendees_controller.rb

	def index
		@attendee = Attendee.new
		@attendees = Attendee.page(params[:page]).per(12)
		@remain =  Attendee.joins(:stamps).where(stamps: { sign_out: nil }).count
		@all_attendees = Attendee.count - @remain
---
SELECT  "stamps".* FROM "stamps" WHERE "stamps"."attendee_id" = ? ORDER BY "stamps"."id" DESC LIMIT ?  [["attendee_id", 1], ["LIMIT", 1]]