app/models/user.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "nickname", "provider", "uid") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "marvin"], ["uid", "19946"], ["LIMIT", 1]]
---
 def self.from_omniauth(auth)
     where(provider: auth.provider, uid: auth.uid).first_or_create do |user|